import 'package:places/ui/screen/sight_card.dart';
import 'domain/sight.dart';

final List<Sight> mocks = [
  Sight(
    name: 'ЦУМ',
    lat: 55.760798,
    lon: 37.619774,
    url:
        'https://msbpartner.ru/wp-content/uploads/c/7/b/c7b97cca60af134d6cd107ea59e537e6.jpeg',
    details:
        'ЦУМ (Центральный универсальный магазин) — магазин в центре Москвы, расположенный на углу Петровки и Театральной площади по адресу: ул. Петровка, дом 2. Появился здесь в 1885 году как торговый дом «Мюр и Мерилиз», семиэтажное здание в готическом стиле было построено в 1908 году. После революции был национализирован, современное название носит с 1933 года. В 2002 году перешёл в собственность группы компаний Mercury. С общей площадью в 70 000 м² является одним из крупнейших универмагов Европы.',
    type: 'Торговый центр',
  ),
  Sight(
    name: 'ГУМ',
    lat: 55.7549226,
    lon: 37.6211863,
    url: 'https://guruturizma.ru/wp-content/uploads/2017/10/GUM.jpg',
    details:
        'ГУМ (аббревиатура от «Государственный универсальный магазин», до 1921 года — Верхние торговые ряды) — крупный торговый комплекс (универсальный магазин) в центре Москвы, который занимает местность Китай-города и выходит главным фасадом на Красную площадь. Позиционирует себя как главный универсальный магазин страны и целый торговый квартал.  Здание, построенное в 1893 году в русском стиле, является памятником архитектуры федерального значения и находится в федеральной собственности. Находится в аренде у компании Михаила Куснировича Bosco di Ciliegi до 2059 года.',
    type: 'Торговый центр',
  ),
  Sight(
    name: 'Большой театр',
    lat: 55.7601335,
    lon: 37.6164599,
    url:
        'https://www.freezone.net/upload/medialibrary/cec/cec182c6e9139e8a65a7164f47d07910.jpg',
    details:
        'Федеральное государственное бюджетное учреждение культуры «Государственный академический Большой театр России», Большой театр России или просто Большой театр — один из крупнейших в России и один из самых значительных в мире театров оперы и балета.  Комплекс зданий театра расположен в центре Москвы, на Театральной площади. Большой театр, его музей, здание исторической сцены — объект культурного наследия народов России федерального значения.',
    type: 'Театр',
  ),
  Sight(
    name: 'Аквакомплекс Лужники',
    lat: 55.71351627910871,
    lon: 37.55818656443049,
    url:
        'https://sun9-76.userapi.com/oPHI5XOoSk-xPq44JbbfWmlCV0xm6-DT_gXKiw/LYOKMT0l4xc.jpg',
    details:
        'Аквапарк находится в самом центре Москвы, на территории комплекса Лужники.  Во дворце водных видов спорта Лужники, можно не только хорошо отдохнуть с семьей, но и позаниматься спортом.  На втором этаже расположился Аквапарк. В нем 9 горок. Есть горки и для любителей экстрима, и для любителей игр, и для новичков. Также есть бассейны с волнами, есть и термо бассейн под открытым небом с видом на Воробьевы горы. Для самых маленьких гостей есть детский городок с горками, бассейнами и фонтанчиками.',
    type: 'Спорт',
  ),
  Sight(
    name: 'Третьяковская галерея',
    lat: 55.741489266010824,
    lon: 37.62088426195316,
    url:
        'https://cdn.otr-online.ru/files/news/2019-12/1020x574/medium_lori-0027355721-bigwww-1.jpg',
    details:
        'Госуда́рственная Третьяко́вская галере́я — московский художественный музей, основанный в 1856 году купцом Павлом Третьяковым. В 1867-м галерея была открыта для посещения, а в 1892 году передана в собственность Москве. На момент передачи коллекция музея насчитывала 1276 картин, 471 рисунок, десять скульптур русских художников, а также 84 картины иностранных мастеров.',
    type: 'Музей',
  ),
  Sight(
    name: 'Галерея Искусств Зураба Церетели',
    lat: 55.74175267723169,
    lon: 37.59366068034585,
    url:
        'https://7holmov-moscow.ru/wp-content/uploads/2019/10/Galereya_iskusstv_TSereteli-600x450.jpg',
    details:
        'Галере́я иску́сств Зура́ба Церете́ли — музейно-выставочный комплекс Российской академии художеств в Москве. Галерея основана в 2001 году директором Академии художеств Зурабом Церетели. В основе экспозиции лежит частная коллекция архитектора, состоящая из художественных, графических и скульптурных работ. Галерея расположена в усадьбе XVIII века, ранее принадлежавшей семье Долгоруковых.',
    type: 'Музей',
  ),
];
