import 'domain/sight.dart';

final List<Sight> mocks = [
  Sight(
    name: 'ЦУМ',
    lat: 55.760798,
    lon: 37.619774,
    url:
        'https://msbpartner.ru/wp-content/uploads/c/7/b/c7b97cca60af134d6cd107ea59e537e6.jpeg',
    details:
        'ЦУМ (Центральный универсальный магазин) — магазин в центре Москвы, расположенный на углу Петровки и Театральной площади по адресу: ул. Петровка, дом 2. Появился здесь в 1885 году как торговый дом «Мюр и Мерилиз», семиэтажное здание в готическом стиле было построено в 1908 году. После революции был национализирован, современное название носит с 1933 года. В 2002 году перешёл в собственность группы компаний Mercury. С общей площадью в 70 000 м² является одним из крупнейших универмагов Европы.',
    type: 'Торговый центр',
  ),
  Sight(
    name: 'ГУМ',
    lat: 55.7549226,
    lon: 37.6211863,
    url: 'https://guruturizma.ru/wp-content/uploads/2017/10/GUM.jpg',
    details:
        'ГУМ (аббревиатура от «Государственный универсальный магазин», до 1921 года — Верхние торговые ряды) — крупный торговый комплекс (универсальный магазин) в центре Москвы, который занимает местность Китай-города и выходит главным фасадом на Красную площадь. Позиционирует себя как главный универсальный магазин страны и целый торговый квартал.  Здание, построенное в 1893 году в русском стиле, является памятником архитектуры федерального значения и находится в федеральной собственности. Находится в аренде у компании Михаила Куснировича Bosco di Ciliegi до 2059 года.',
    type: 'Торговый центр',
  ),
  Sight(
    name: 'Большой театр',
    lat: 55.7601335,
    lon: 37.6164599,
    url:
        'https://www.freezone.net/upload/medialibrary/cec/cec182c6e9139e8a65a7164f47d07910.jpg',
    details:
        'Федеральное государственное бюджетное учреждение культуры «Государственный академический Большой театр России», Большой театр России или просто Большой театр — один из крупнейших в России и один из самых значительных в мире театров оперы и балета.  Комплекс зданий театра расположен в центре Москвы, на Театральной площади. Большой театр, его музей, здание исторической сцены — объект культурного наследия народов России федерального значения.',
    type: 'Театр',
  ),
];
